-- MySQL dump 10.13  Distrib 8.0.36, for Win64 (x86_64)
--
-- Host: localhost    Database: moviesguide
-- ------------------------------------------------------
-- Server version	8.0.36

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `movie`
--

DROP TABLE IF EXISTS `movie`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `movie` (
  `Id` int NOT NULL AUTO_INCREMENT,
  `Name` varchar(50) NOT NULL,
  `YearOfEdition` int NOT NULL,
  `Description` varchar(500) NOT NULL,
  `Rate` float DEFAULT NULL,
  `Genre` int NOT NULL,
  `CoverImage` varchar(500) DEFAULT NULL,
  PRIMARY KEY (`Id`)
) ENGINE=InnoDB AUTO_INCREMENT=19 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `movie`
--

LOCK TABLES `movie` WRITE;
/*!40000 ALTER TABLE `movie` DISABLE KEYS */;
INSERT INTO `movie` VALUES (6,'Оппенгеймер\n',2023,'У розпал Другої світової війни полковник США Леслі Гровс призначає блискучого фізика-теоретика Роберта Оппенгеймера науковим керівником Манхеттенського проєкту. Оппенгеймер проводить успішні випробування першої у світі ядерної бомби, що дозволяє наблизити перемогу у війні. Проте чоловіка мучать докори совісті, оскільки його винахід здатний призвести до знищення всього людства.',8.3,3,'8215.jpg'),(8,'Тепер я йду у дику далечінь\n	',2007,'Молодий Крістофер МакКендлес, що виріс у забезпеченій сім\'ї, закінчує Університет Еморі з відзнакою, проте відмовляється будувати кар\'єру та налагоджувати стабільне життя. Натомість він жертвує на благодійність усі свої заощадження у розмірі 24 тисяч доларів, збирає речі та вирушає автостопом подорожувати Америкою. У квітні 1992 року Крістофер прибуває до Деналі, віддаленого регіону Аляски, де починає жити серед дикої природи в старому автобусі та стикається зі своєю останньою пригодою.',8.1,1,'7795.jpg'),(10,'Кохання та інші ліки\n	',2010,'Джеймі Ренделл — ловелас і дамський угодник,  Під час одного з прийомів Джеймі зустрічає Меггі. Невелика інтрижка між Джеймі і Меггі переростає в більш серйозні відносини. Але після того, як з\'ясовується, що дівчина хвора на невиліковну хворобу Паркінсона (прогресуюче захворювання, яке вражає роботу центральної нервової системи), між закоханими виникають труднощі...',6.7,7,'2878.jpg'),(11,'Вечірка\n	',2017,'Член британського парламенту Джанет досягає піка своєї кар\'єри, отримавши посаду міністра охорони здоров\'я у тіньовому кабінеті офіційної опозиції та вирішує організувати з цього приводу невелику вечірку у себе вдома. У міру того, як вечірка набирає обертів, між гостями та Джанет сильно загострюється обстановка, що призводить до вибухонебезпечної ситуації.',6.5,2,'8623.jpg'),(12,'Мадам Павутина\n	',2024,'У 1973 році безстрашна дослідниця Констанс Вебб, незважаючи на свою вагітність, розшукує в перуанських джунглях рідкісного павука. Жінка трагічно гине, але перед смертю встигає народити здорову дівчинку Кассандру, яка від павукової отрути набуває екстрасенсорних здібностей.',3.8,0,'8536.jpg'),(13,'Сценарій мрії\n	',2023,'Пол Меттьюз — звичайний і нічим не примітний професор біології середнього віку, що живе з дружиною та дочкою. Нудне та одноманітне життя чоловіка перевертається з ніг на голову, коли з\'ясовується, що він несподівано став головним героєм сновидінь мільйонів людей по всьому світу. ',6.9,5,'8400.jpg'),(14,'Ігри свідомості\n	',2020,'Молодий нейробіолог Ітан, що веде самітницький спосіб життя, хоче продовжити справу свого покійного батька, розраховуючи розгадати загадку людської свідомості. Майже безвилазно він знаходиться у лабораторії, обладнаній у підвалі свого будинку, де проводить досліди над власним мозком. Внаслідок одного з таких експериментів розум чоловіка розщеплюється на десять частин, які захоплюють владу над свідомістю кожні шість хвилин. ',5.1,6,'8361.jpg'),(15,'Кімната вбивств\n	',2023,'Патріс — власниця художньої галереї, яка опинилася у скрутному становищі: її бізнес втрачає популярність, а вона не може укласти контракти з успішними митцями й починає вживати наркотики. Кримінальний бос Гордон, дізнавшись подробиці про жахливу фінансову ситуацію Патріс, пропонує партнерство жінці, збираючись за її допомогою відмити кошти, здобуті злочинним шляхом',5.5,9,'8565.jpg'),(18,'Дюна: частина друга \n	',2024,'Молодий герцог Пол Атрід, що має дар ясновидіння, дивом переживає замах на свою сім\'ю, після чого разом з матір\'ю, леді Джессікою, ховається від переслідування серед безмежної пустелі. Двоє знаходять безпечний притулок у таборі фременів — волелюбного народу, який за багато століть пристосувався до життя у суворих умовах планети Арракіс.',9.7,4,'8520.jpg');
/*!40000 ALTER TABLE `movie` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-04-30 21:47:59
